        <?php require_once('../public/global.php')?>
        <?php
            /*
            |--------------------------------------------------------------
            |额外样式表
            |-------------------------------------------------------------- 
            */
            $config["extra_stylesheets"] = array();

            /*
            |--------------------------------------------------------------
            |额外脚本
            |--------------------------------------------------------------
            */            
            $config["extra_javascripts"] = array();

            /*
            |--------------------------------------------------------------
            |页面标题
            |--------------------------------------------------------------   
            */
            $config["page_title"] = "宁波银泰城_东部核心区商业中心_管家式服务";

            /*
            |--------------------------------------------------------------
            |页面描述
            |--------------------------------------------------------------
            */
            $config["page_description"] = "宁波悟空找房为您推荐宁波银泰城,位于鄞州区,项目拥有主题式购物公园,住宅,风情商业街和国际写字楼四大高端业态,住宅缴2万抵5万,商业步行街占地20万方,宁波银泰城三面环水,60米宽沿河景观带应有尽有,居住与投资同步进行,尽在宁波悟空找房。";

            /*
            |--------------------------------------------------------------
            |页面关键字
            |--------------------------------------------------------------   
            */
            $config["page_keywords"] = "宁波新楼盘,宁波商铺,宁波新房,宁波投资项目,宁波悟空找房";

            /*
            |--------------------------------------------------------------
            |是否根据路由加载样式表
            |如果匹配则会生成活动目录下的less/[web|wap].less文件
            |--------------------------------------------------------------  
            */
            $config["match_stylesheet"] = false;

            /*
            |--------------------------------------------------------------
            |是否根据路由加载脚本
            |如果匹配则会生成活动目录下的jssrc/[web|wap].js文件
            |--------------------------------------------------------------   
            */
            $config["match_javascripts"] = false;

            /*
            |--------------------------------------------------------------
            |是否包含预约功能
            |--------------------------------------------------------------   
            */
            $config["include_reserve"] = true;

            /*
            |--------------------------------------------------------------
            |房产Id,调用预约接口时使用
            |房产名称
            |--------------------------------------------------------------   
            */
            $config["estate_Id"] = "82944";
            $config["estate_name"] = "东部新城银泰城";

            /*
            |--------------------------------------------------------------
            |是否支持微信分享
            |微信分享标题
            |微信分享内容
            |--------------------------------------------------------------   
            */
            $config["wechat_share"] = true;
            $config["wechat_title"] = "东部新城银泰城   东部新城正核芯   135平正四房";
            $config["wechat_content"] = "拥有主题式购物公园、住宅、风情商业街和国际写字楼四大高端业态 未来政治经济文化和商业中心 公交线路众多，可到达宁波的各个区域 大型城市综合体，绿城物业，管家式服务";

            /*
            |--------------------------------------------------------------
            |热线电话
            |分机号码
            |--------------------------------------------------------------   
            */
            $config["hotline"] = "4009230626";
            $config["hotline_subnum"] = "9457";
        ?>                        