/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 1. 项目名称：悟空找房活动推广前端框架
 2. 页面名称：web.html
 3. 作者：yinqin@lifang.com
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
function WebController() {
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
     继承于Controller基类
     -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    Controller.call(this);
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
     init
     -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.init();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
     bindEvent
     -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.bindEvent();
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 绑定事件
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
WebController.prototype.bindEvent = function() {
    var classSelf = this;
    //获取验证码方法
    $("#sendCodeBtn").click(function() {
        if (classSelf.allowed) { //如果allowed为true,则发送请求
            var data = {
                phoneNum: $('#custMobile').val().trim(),
                msgSourceType: 3
            };
            classSelf.request(classSelf.apiUrl.wechat.getPhoneVertifyCode, data, {
                'type': 'GET',
                'process': function() {
                    //执行60s倒计时
                    classSelf.countDown();
                },
                'onExceptionInterface': function(data) {
                    //显示出错信息
                    classSelf.showLog(data.message);
                }
            });
        }
    });

    //保存数据方法
    //@source：1表示web端  2表示wap端
    $("#sendBtn").click(function() {
        var data = {
            custName: $('#custName').val().trim(),
            custMobile: $('#custMobile').val().trim(),
            subEstateName: $('#subEstateName').val().trim(),
            subEstateId:$('#subEstateId').val().trim(),
            vertifyCode: $('#vertifyCode').val().trim(),
            source: 1
        };
        classSelf.request(classSelf.apiUrl.wechat.saveData, data, { //发送请求
            'type': 'GET',
            'process': function() {
                //成功则隐藏预约框，显示预约成功框
                $(".w-alert-box").show();
            },
            'onExceptionInterface': function(data) {
                //出错则在页面上显示出错信息
                classSelf.showLog(data.message);
            }
        });
    });


};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 init
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
WebController.prototype.init = function(){
    //隐藏预约框
    $(".fixedBottom").css("display", "none");
    //当页面滚动到>banner3位置时，需要显示,<=banner3时,需要隐藏
    $(window).scroll(function() {
        var banner3Scroll = $("#banner3").offset().top, //第3张图片离顶部的高度
            scrollTop = $(window).scrollTop();
        if (scrollTop >= banner3Scroll) {
            $(".fixedBottom").css("display", "block");
        } else {
            $(".fixedBottom").css("display", "none");
        }
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
pc端显示错误信息方法
@msg: 出错提示的信息
@callback： 回调函数
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
WebController.prototype.showLog = function(msg, callback) {
    var classSelf = this;
    if (classSelf.toastStatus) { //如果页面没有出错提示框，将toastStatus标记置为false，新建添加到body中并显示
        classSelf.toastStatus = false;
        var errElm = $('.wk-toast');
        if (!errElm[0]) {
            errElm = $('<div class="wk-toast"></div>').appendTo('body');
        }
        errElm.html(msg).addClass('show');
        setTimeout(function() { // 2400后自动消失，将toastStatus标记置为true,并且执行callback函数
            errElm.removeClass('show');
            classSelf.toastStatus = true;
            callback && callback();
        }, 2400);
    }
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
类的初始化
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
$(document).ready(function() {
    new WebController;
});