        <?php require_once('../public/global.php')?>
        <?php
            /*
            |--------------------------------------------------------------
            |额外样式表
            |-------------------------------------------------------------- 
            */
            $config["extra_stylesheets"] = array("../public/css/web_brand.min.css");

            /*
            |--------------------------------------------------------------
            |额外脚本
            |--------------------------------------------------------------
            */            
            $config["extra_javascripts"] = array();

            /*
            |--------------------------------------------------------------
            |页面标题
            |--------------------------------------------------------------   
            */
            $config["page_title"] = "桐乡楼盘_名城花苑_嘉兴高层楼盘_浙江悟空找房";

            /*
            |--------------------------------------------------------------
            |页面描述
            |--------------------------------------------------------------
            */
            $config["page_description"] = "浙江悟空找房为您推荐,嘉兴楼盘名城花苑,桐乡高层楼盘,沪杭高速出口5分钟,周边配套齐全,紧邻客运中心,高铁站,运动智能型社区,高品质生活,WiFi全覆盖整个小区,精致样板间随时可带看,上悟空找房选新房,悟空找房,真棒。";

            /*
            |--------------------------------------------------------------
            |页面关键字
            |--------------------------------------------------------------   
            */
            $config["page_keywords"] = "嘉兴新房,嘉兴二手房,嘉兴学区房,嘉兴小高层,桐乡楼盘";

            /*
            |--------------------------------------------------------------
            |是否根据路由加载样式表
            |如果匹配则会生成活动目录下的less/[web|wap].less文件
            |--------------------------------------------------------------  
            */
            $config["match_stylesheet"] = false;

            /*
            |--------------------------------------------------------------
            |是否根据路由加载脚本
            |如果匹配则会生成活动目录下的jssrc/[web|wap].js文件
            |--------------------------------------------------------------   
            */
            $config["match_javascripts"] = false;

            /*
            |--------------------------------------------------------------
            |是否包含预约功能
            |--------------------------------------------------------------   
            */
            $config["include_reserve"] = true;

            /*
            |--------------------------------------------------------------
            |房产Id,调用预约接口时使用
            |房产名称
            |--------------------------------------------------------------   
            */
            $config["estate_Id"] = "155715";
            $config["estate_name"] = "名城花苑";

            /*
            |--------------------------------------------------------------
            |是否支持微信分享
            |微信分享标题
            |微信分享内容
            |--------------------------------------------------------------   
            */
            $config["wechat_share"] = true;
            $config["wechat_title"] = "居中心，享一城繁华  名城花苑";
            $config["wechat_content"] = " 微信分享的内容：双轨交纯住宅，智能化社区，性价比高，配套完善，五优生活， 桐乡市青阳路与320国道交汇处";

            /*
            |--------------------------------------------------------------
            |热线电话
            |分机号码
            |--------------------------------------------------------------   
            */
            $config["hotline"] = "4008208907";
            $config["hotline_subnum"] = "12582";
            //名城花苑  4008208907转12582  4008208907转22582
            $config["web_hotline"] = "4008208907";
            $config["web_hotline_subnum"] = "12582";
            $config["wap_hotline"] = "4008208907";
            $config["wap_hotline_subnum"] = "22582";
        ?>                        