        <?php require_once('../public/global.php')?>
        <?php
            /*
            |--------------------------------------------------------------
            |额外样式表
            |-------------------------------------------------------------- 
            */
            $config["extra_stylesheets"] = array("../public/css/web_brand.min.css");

            /*
            |--------------------------------------------------------------
            |额外脚本
            |--------------------------------------------------------------
            */            
            $config["extra_javascripts"] = array();

            /*
            |--------------------------------------------------------------
            |页面标题
            |--------------------------------------------------------------   
            */
            $config["page_title"] = "海宁楼盘推荐_嘉兴悟空找房";

            /*
            |--------------------------------------------------------------
            |页面描述
            |--------------------------------------------------------------
            */
            $config["page_description"] = "海宁四季香榭是嘉兴悟空找房推荐楼盘,位于海宁市核心商圈内,适用于投资,居住,学区,养生等,近景区,风景秀美,周边学校林立,配套齐全,法式建筑,户型多样满足家庭需求,悟空找房更有优惠活动买新房,海宁买房就上悟空找房";

            /*
            |--------------------------------------------------------------
            |页面关键字
            |--------------------------------------------------------------   
            */
            $config["page_keywords"] = "嘉兴新房,海宁新房,嘉兴学区房,嘉兴二手房,海宁二手房";

            /*
            |--------------------------------------------------------------
            |是否根据路由加载样式表
            |如果匹配则会生成活动目录下的less/[web|wap].less文件
            |--------------------------------------------------------------  
            */
            $config["match_stylesheet"] = false;

            /*
            |--------------------------------------------------------------
            |是否根据路由加载脚本
            |如果匹配则会生成活动目录下的jssrc/[web|wap].js文件
            |--------------------------------------------------------------   
            */
            $config["match_javascripts"] = false;

            /*
            |--------------------------------------------------------------
            |是否包含预约功能
            |--------------------------------------------------------------   
            */
            $config["include_reserve"] = true;

            /*
            |--------------------------------------------------------------
            |房产Id,调用预约接口时使用
            |房产名称
            |--------------------------------------------------------------   
            */
            $config["estate_Id"] = "155079";
            $config["estate_name"] = "四季香榭";

            /*
            |--------------------------------------------------------------
            |是否支持微信分享
            |微信分享标题
            |微信分享内容
            |--------------------------------------------------------------   
            */
            $config["wechat_share"] = true;
            $config["wechat_title"] = "唤醒花园梦想，收藏四季之美  四季香榭";
            $config["wechat_content"] = "配套完善，豪宅品质，性价比高，投资上品， 海宁市康乐路177号";

            /*
            |--------------------------------------------------------------
            |热线电话
            |分机号码
            |--------------------------------------------------------------   
            */
            $config["hotline"] = "4008208907";
            $config["hotline_subnum"] = "12559";
            $config["web_hotline"] = "4008208907";
            $config["web_hotline_subnum"] = "12559";
            $config["wap_hotline"] = "4008208907";
            $config["wap_hotline_subnum"] = "12559";
        ?>                        